print('Задача 4. Площадь треугольника\n')

# Напишите программу, которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

a = int(input('Введите длину первого катета: '))
b = int(input('Введите длину второго катета: '))

s = a * b / 2

print('\nПлощадь прямоугольного треугольника:', s)
